In [1]:
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Excerpt From
# Machine Learning with Python Cookbook
# Chris Albon
# This material may be protected by copyright.

df = pd.read_csv(url)

In [3]:
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [4]:
df[df['Sex'] == 'female']

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
...,...,...,...,...,...,...
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [5]:
df[(df['Sex'] == 'female') & (df['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [6]:
df['Sex'].replace('female', 'woman').head()

0    woman
1    woman
2     male
3    woman
4     male
Name: Sex, dtype: object

In [7]:
df['Sex'].replace(['male', 'female'], ['Man', 'Woman']).head()

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [8]:
df.replace(1, 'One').head(2)

                           Name PClass   Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female      One     One
1   Allison, Miss Helen Loraine    1st   2.0  female        0     One

In [9]:
df.replace(r"1st", "First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

In [10]:
# renaming columns

In [11]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB

In [13]:
# selecting unique values in a column
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [14]:
# handling missing values
# to have full funcionality with NaN we have to import NumPy first
import numpy as np

In [15]:
# replace values with NaN
df['Sex'] = df['Sex'].replace('male', np.nan)

In [16]:
# pandas read_csv includes a parameter allowing us to specify the values used
# to indicate missing values:
df = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [17]:
# delete a column of a df
df.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [18]:
# dropping multiple columns
df.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [19]:
# dropping a column by index
df.drop(df.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [20]:
# deleting a row
df[df['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [22]:
# can use df.drop to delete a row, but more often
# just using a boolean mask is a better solution
df[df['Name'] != 'Allison, Miss Helen Loraine'].\
head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [23]:
# delete a single row by index using a mask
df[df.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [24]:
# dropping duplicates from a df
# the drop_duplicates() method defaults to only dropping rows that 
# match perfectly across all columns. Under this condition, every row
# in this current df is unique and none will be dropped. For this reason
# we often want to consider only a subset of columns with subset param
df.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [25]:
# can use the keep parameter if we don't want the default behavior of 
# dropping all but the first instance:
df.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [26]:
# if you just want to see which rows have duplicates, you can use
# duplicated() which returns a boolean series indicating whether row
# is a duplicate or not

#### Grouping rows by values

In [30]:
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [31]:
# we must choose an aggregating function to get a meaningful result
# from a groupby. Some aggregates are not appropriate for some data
# types so here we tell python to aggregate on name so we can use count()
df.groupby('Sex')['Name'].count()

Sex
female    462
male      851
Name: Name, dtype: int64

In [32]:
df.groupby('Sex').count()

        Name  PClass  Age  Survived  SexCode
Sex
female   462     462  288       462      462
male     851     851  468       851      851

In [33]:
# above we can see that there were NaNs in Age that were not counted

In [35]:
# to see mean age grouped by sex and survival:
df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64